GopalSaraf/Practicals/PSDL/include/proc/pic16f1825.inc
// Register: APFCON0
#define APFCON0 APFCON0
APFCON0                                  equ 011Dh
// bitfield definitions
APFCON0_TXCKSEL_POSN                     equ 0002h
APFCON0_TXCKSEL_POSITION                 equ 0002h
APFCON0_TXCKSEL_SIZE                     equ 0001h
APFCON0_TXCKSEL_LENGTH                   equ 0001h
APFCON0_TXCKSEL_MASK                     equ 0004h
APFCON0_T1GSEL_POSN                      equ 0003h
APFCON0_T1GSEL_POSITION                  equ 0003h
APFCON0_T1GSEL_SIZE                      equ 0001h
APFCON0_T1GSEL_LENGTH                    equ 0001h
APFCON0_T1GSEL_MASK                      equ 0008h
APFCON0_SSSEL_POSN                       equ 0005h
APFCON0_SSSEL_POSITION                   equ 0005h
APFCON0_SSSEL_SIZE                       equ 0001h
APFCON0_SSSEL_LENGTH                     equ 0001h
APFCON0_SSSEL_MASK                       equ 0020h
APFCON0_SDOSEL_POSN                      equ 0006h
APFCON0_SDOSEL_POSITION                  equ 0006h
APFCON0_SDOSEL_SIZE                      equ 0001h
APFCON0_SDOSEL_LENGTH                    equ 0001h
APFCON0_SDOSEL_MASK                      equ 0040h
APFCON0_RXDTSEL_POSN                     equ 0007h
APFCON0_RXDTSEL_POSITION                 equ 0007h
APFCON0_RXDTSEL_SIZE                     equ 0001h
APFCON0_RXDTSEL_LENGTH                   equ 0001h
APFCON0_RXDTSEL_MASK                     equ 0080h

// Register: APFCON1
#define APFCON1 APFCON1
APFCON1                                  equ 011Eh
// bitfield definitions
APFCON1_CCP2SEL_POSN                     equ 0000h
APFCON1_CCP2SEL_POSITION                 equ 0000h
APFCON1_CCP2SEL_SIZE                     equ 0001h
APFCON1_CCP2SEL_LENGTH                   equ 0001h
APFCON1_CCP2SEL_MASK                     equ 0001h
APFCON1_P2BSEL_POSN                      equ 0001h
APFCON1_P2BSEL_POSITION                  equ 0001h
APFCON1_P2BSEL_SIZE                      equ 0001h
APFCON1_P2BSEL_LENGTH                    equ 0001h
APFCON1_P2BSEL_MASK                      equ 0002h
APFCON1_P1CSEL_POSN                      equ 0002h
APFCON1_P1CSEL_POSITION                  equ 0002h
APFCON1_P1CSEL_SIZE                      equ 0001h
APFCON1_P1CSEL_LENGTH                    equ 0001h
APFCON1_P1CSEL_MASK                      equ 0004h
APFCON1_P1DSEL_POSN                      equ 0003h
APFCON1_P1DSEL_POSITION                  equ 0003h
APFCON1_P1DSEL_SIZE                      equ 0001h
APFCON1_P1DSEL_LENGTH                    equ 0001h
APFCON1_P1DSEL_MASK                      equ 0008h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 018Ch
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSELA_POSN                       equ 0000h
ANSELA_ANSELA_POSITION                   equ 0000h
ANSELA_ANSELA_SIZE                       equ 0005h
ANSELA_ANSELA_LENGTH                     equ 0005h
ANSELA_ANSELA_MASK                       equ 001Fh

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 018Eh
// bitfield definitions
ANSELC_ANSC0_POSN                        equ 0000h
ANSELC_ANSC0_POSITION                    equ 0000h
ANSELC_ANSC0_SIZE                        equ 0001h
ANSELC_ANSC0_LENGTH                      equ 0001h
ANSELC_ANSC0_MASK                        equ 0001h
ANSELC_ANSC1_POSN                        equ 0001h
ANSELC_ANSC1_POSITION                    equ 0001h
ANSELC_ANSC1_SIZE                        equ 0001h
ANSELC_ANSC1_LENGTH                      equ 0001h
ANSELC_ANSC1_MASK                        equ 0002h
ANSELC_ANSC2_POSN                        equ 0002h
ANSELC_ANSC2_POSITION                    equ 0002h
ANSELC_ANSC2_SIZE                        equ 0001h
ANSELC_ANSC2_LENGTH                      equ 0001h
ANSELC_ANSC2_MASK                        equ 0004h
ANSELC_ANSC3_POSN                        equ 0003h
ANSELC_ANSC3_POSITION                    equ 0003h
ANSELC_ANSC3_SIZE                        equ 0001h
ANSELC_ANSC3_LENGTH                      equ 0001h
ANSELC_ANSC3_MASK                        equ 0008h
ANSELC_ANSELC_POSN                       equ 0000h
ANSELC_ANSELC_POSITION                   equ 0000h
ANSELC_ANSELC_SIZE                       equ 0004h
ANSELC_ANSELC_LENGTH                     equ 0004h
ANSELC_ANSELC_MASK                       equ 000Fh

// Register: EEADRL
#define EEADRL EEADRL
EEADRL                                   equ 0191h
// bitfield definitions
EEADRL_EEADRL_POSN                       equ 0000h
EEADRL_EEADRL_POSITION                   equ 0000h
EEADRL_EEADRL_SIZE                       equ 0008h
EEADRL_EEADRL_LENGTH                     equ 0008h
EEADRL_EEADRL_MASK                       equ 00FFh

// Register: EEADRH
#define EEADRH EEADRH
EEADRH                                   equ 0192h
// bitfield definitions
EEADRH_EEADRH_POSN                       equ 0000h
EEADRH_EEADRH_POSITION                   equ 0000h
EEADRH_EEADRH_SIZE                       equ 0007h
EEADRH_EEADRH_LENGTH                     equ 0007h
EEADRH_EEADRH_MASK                       equ 007Fh

